src/bsl/InformationRegisters/гкс_ХранилищеНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ХранилищеНастроек</Name>
			<Comment>GKSTCPLK-254</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ХранилищеНастроек/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьСохраненныеНастройки(КлючОбъекта, КлючНастроек) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеНастройки = Новый Соответствие;	
	Отбор = Новый Структура("КлючОбъекта,КлючНастроек", КлючОбъекта, КлючНастроек);
	
	Структура = РегистрыСведений.гкс_ХранилищеНастроек.Получить(Отбор);
	
	Если Не Структура = Неопределено Тогда
		
		Настройки = Структура.Настройки.Получить();
		
		Если ТипЗнч(Настройки) = Тип("Соответствие") Тогда						
			Для Каждого ЭлементНастройки Из Настройки Цикл
				ДанныеНастройки.Вставить(ЭлементНастройки.Ключ, ЭлементНастройки.Значение);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат ДанныеНастройки;
	
КонецФункции

Процедура СохраненитьНастройку(КлючОбъекта, КлючНастроек, Настройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.гкс_ХранилищеНастроек.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КлючОбъекта = КлючОбъекта;
	МенеджерЗаписи.КлючНастроек = КлючНастроек;
	МенеджерЗаписи.Настройки = Новый ХранилищеЗначения(Настройки);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьНастройку(КлючОбъекта, КлючНастроек) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.гкс_ХранилищеНастроек.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КлючОбъекта = КлючОбъекта;
	МенеджерЗаписи.КлючНастроек = КлючНастроек;
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

#КонецОбласти
